snlkuharlocal/src/Documents/УстановкаУсловийРаботыКонтрагента/УстановкаУсловийРаботыКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаУсловийРаботыКонтрагента</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.СтатусыСкидокКонтрагента</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаИзменийУсловийРаботы</name>
      <type>
        <types>CatalogRef.ПричиныИзменийУсловийРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкидкиПослеИзменения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.СтатусыСкидокКонтрагента</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаИзменийУсловийРаботы</name>
      <type>
        <types>CatalogRef.ПричиныИзменийУсловийРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/УстановкаУсловийРаботыКонтрагента/ObjectModule.bsl
Перем ОтработаноДоИзменений; 


Процедура ОбработкаПроведения(Отказ, РежимПроведения)

 	форма=ЭтотОбъект.ПолучитьФорму("ФормаДокумента");
 	КонтрагентОбъект=Контрагент.ПолучитьОбъект();
	  
	Если этотОбъект.Отработано = истина и ОтработаноДоИзменений=ложь  тогда
	форма.ЭлементыФормы.Надпись1.Картинка = БиблиотекаКартинок.ВыполненоУспешно32;	
		для каждого СтрКонтрагента из КонтрагентОбъект.Скидки цикл
			СтрКонтрагента.Скидка = 0;
		Конеццикла;
		
		для каждого СтрТч из СкидкиПослеИзменения цикл
			
			Структура = новый структура;
			Структура.Вставить("Номенклатура",СтрТЧ.Номенклатура);							
			
			НайденнаяСтрокаВСправочнике=КонтрагентОбъект.Скидки.НайтиСтроки(Структура);
			
			// если строка нашлась, то просто изменяем скидку
			если НайденнаяСтрокаВСправочнике.Количество()<>0 тогда;		
				
				Для каждого Строчка из НайденнаяСтрокаВСправочнике цикл
					Строчка.скидка=СтрТч.скидка;
					ЗаполнитьЗначенияСвойств(Строчка,СтрТч); 
				Конеццикла;
				
				//если новая строчка
			иначе 		
				НоваяСтрока=КонтрагентОбъект.Скидки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрТч); 
			конецесли;	
		Конеццикла;	
		
		
		МассивУдаляемыхСтрок=КонтрагентОбъект.Скидки.НайтиСтроки(новый Структура("Скидка",0));
		для каждого СтрМассива из МассивУдаляемыхСтрок цикл
			КонтрагентОбъект.Скидки.Удалить(СтрМассива);
		КонецЦикла;
		ОтработаноПослеИзменени=Отработано;
		ОтработаноПослеИзменени=Истина;
	
		КонтрагентОбъект.Записать();		
		КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
ОтработаноДоИзменений = Ссылка.Отработано;
КонецПроцедуры

процедура ПриКопировании(ЭтотОбъект);
	Скидки.Очистить();
	СкидкиПослеИзменения.Очистить();
	Отработано=Ложь;
конецпроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Скидки.Очистить();
	СкидкиПослеИзменения.Очистить();
	Отработано=Ложь;

КонецПроцедуры
